package week4.section1_basics_exceptions;

public class question_4_1_7 {
    /*
     * Вопрос: Сопоставьте названия классов с их назначением.
     *
     *
     * Ответ:
     * java.lang.Throwable - Базовый класс для всех исключений;
     * java.lang.Exception - Базовый класс для проверяемых исключений,
     *                       соответствующих ошибкам программной логики;
     * java.lang.RuntimeException - Базовый класс для непроверяемых исключений,
     *                              соответствующих ошибкам программной логики
     * java.lang.Error - Базовый класс для исключений, соответствующих
     *                   ошибкам виртуальной машины
     *
     */
}
