package week3.section2_packages_and_access_modificators;

public class question_3_2_6 {
    /*
     * Вопрос: Какую директиву import надо поставить в начале исходного файла,
     * чтобы получить возможность вызывать любые статические методы класса java.lang.System
     * и обращаться к любым его статическим полям без указания имени класса?
     *
     * Напишите единственную директиву import точно так, как вы написали бы ее в программе,
     * включая точку запятой в конце.
     *
     *
     * Ответ: import static java.lang.System.*;
     *
     */
}
